app/controllers/users_controller.rb

  def new
    if (current_user && current_user.login != 'admin') || (!current_user && User.all.size != 0)
---
SELECT * FROM "users"

  def index
    @users = User.all
---
SELECT * FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('qMcmUOqMT7HDVT_YOoOi', '2009-09-14 05:57:55', '2009-09-14 05:57:55', '5847c1551181b5f9e614ed271ba1accc7d649b3f8c2b5badfbfedff4c561952f8cec9730343b231e61c972c8ad4f10b6c615346be8ff081969db973e6cf8558a', 'msyetcqJbFJvd__1U2GT', '2009-09-14 05:57:55', 0, '127.0.0.1', 'oLHFq2WydOui-tjRKEy2', '2009-09-14 05:57:54', '6e3da15591de01f83209573cb064c0c4fdca66349384cf439b7f0f2af7e38a500dae3217949b5c6fbc8e0d4a2f45140743f387c4dfacade2b8ff4f3cb1e77970', 1, NULL, 'admin', NULL, 'maurizio.demagnis@gmail.com')